In [79]:
import pandas as pd

# Example DataFrame
data = {'age': [25, 30, 35, 40],
        'salary': [50000, 60000, 70000, 80000]}
df = pd.DataFrame(data)

# Get descriptive statistics
df.describe()

             age        salary
count   4.000000      4.000000
mean   32.500000  65000.000000
std     6.454972  12909.944487
min    25.000000  50000.000000
25%    28.750000  57500.000000
50%    32.500000  65000.000000
75%    36.250000  72500.000000
max    40.000000  80000.000000

In [5]:
# Basic operations
# df.head(): Displays the first few rows of the DataFrame.
# df.tail(): Displays the last few rows.
# df.shape: Shows the number of rows and columns.
# df.columns: Displays the column names.
# df.describe(): Generates summary statistics for numerical columns.

In [8]:
data = {'age': [25, 30, 35, 40],
        'salary': [50000, 60000, 70000, 80000]}
df = pd.DataFrame(data)
df.head()
#df.head(): Displays the first few rows of the DataFrame.

   age  salary
0   25   50000
1   30   60000
2   35   70000
3   40   80000

In [9]:
df.tail()

   age  salary
0   25   50000
1   30   60000
2   35   70000
3   40   80000

In [11]:
df.shape

(4, 2)

In [15]:
df.columns

Index(['age', 'salary'], dtype='object')

In [16]:
df.describe()

             age        salary
count   4.000000      4.000000
mean   32.500000  65000.000000
std     6.454972  12909.944487
min    25.000000  50000.000000
25%    28.750000  57500.000000
50%    32.500000  65000.000000
75%    36.250000  72500.000000
max    40.000000  80000.000000

In [17]:
import pandas as pd
import numpy as np

In [18]:
# Creating a data frame
result = {'name':          ['Alpha','Bravo', 'Charlie','Delta','Echo','Foxtrot','Golf','Hotel','India','Juliet'],
          'roll':          [11,22,33,44,55,66,77,88,99,111],
          'python':        [78,67,89,90,91,72,76,89,67,85],
          'excel':         [89,87,67,74,78,90,76,78,90,54],
           'power_bi':     [45,67,89,87,67,90,65,67,56,90],
          'pandas':        [81,85,89,87,41,45,96,56,93,78],
        'machine_learning':[96,95,84,85,82,81,74,75,96,90],
         'statistics':     [67,48,45,98,75,71,70,60,90,93]}

df = pd.DataFrame(result)
df

,name,roll,python,excel,power_bi,pandas,machine_learning,statistics
0,Alpha,11,78,89,45,81,96,67
1,Bravo,22,67,87,67,85,95,48
2,Charlie,33,89,67,89,89,84,45
3,Delta,44,90,74,87,87,85,98
4,Echo,55,91,78,67,41,82,75
5,Foxtrot,66,72,90,90,45,81,71
6,Golf,77,76,76,65,96,74,70
7,Hotel,88,89,78,67,56,75,60
8,India,99,67,90,56,93,96,90
9,Juliet,111,85,54,90,78,90,93

In [22]:
df.columns = ['Name','Roll','Python','Excel','Power_bi','Pandas','Machine_learning','Statistics']
df.columns

Index(['Name', 'Roll', 'Python', 'Excel', 'Power_bi', 'Pandas',
       'Machine_learning', 'Statistics'],
      dtype='object')

In [23]:
df

,Name,Roll,Python,Excel,Power_bi,Pandas,Machine_learning,Statistics
0,Alpha,11,78,89,45,81,96,67
1,Bravo,22,67,87,67,85,95,48
2,Charlie,33,89,67,89,89,84,45
3,Delta,44,90,74,87,87,85,98
4,Echo,55,91,78,67,41,82,75
5,Foxtrot,66,72,90,90,45,81,71
6,Golf,77,76,76,65,96,74,70
7,Hotel,88,89,78,67,56,75,60
8,India,99,67,90,56,93,96,90
9,Juliet,111,85,54,90,78,90,93

In [24]:
df.rename(columns={'Roll':'Id', 'Statistics':"Stats"},inplace=True)
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [25]:
# Accessing a column
df['Excel']

0    89
1    87
2    67
3    74
4    78
5    90
6    76
7    78
8    90
9    54
Name: Excel, dtype: int64

In [26]:
df['Power_bi']

0    45
1    67
2    89
3    87
4    67
5    90
6    65
7    67
8    56
9    90
Name: Power_bi, dtype: int64

In [27]:
# Fancy index
df[  ['Excel', 'Stats']  ]

   Excel  Stats
0     89     67
1     87     48
2     67     45
3     74     98
4     78     75
5     90     71
6     76     70
7     78     60
8     90     90
9     54     93

In [28]:
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [31]:
# slicing 
df.loc[3:8,'Python':'Pandas']

   Python  Excel  Power_bi  Pandas
3      90     74        87      87
4      91     78        67      41
5      72     90        90      45
6      76     76        65      96
7      89     78        67      56
8      67     90        56      93

In [32]:
# slicing 
df.loc[4:8,'Python':'Pandas']

   Python  Excel  Power_bi  Pandas
4      91     78        67      41
5      72     90        90      45
6      76     76        65      96
7      89     78        67      56
8      67     90        56      93

In [33]:
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

# slicing of dataframe

df.loc[1:2,['Python','Pandas']]

first arg mein colon se pehle row starting row colon ke bad ending row

dosre arg mein column

In [40]:
df.loc[3:8,['Python','Pandas']]

   Python  Pandas
3      90      87
4      91      41
5      72      45
6      76      96
7      89      56
8      67      93

In [41]:
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [46]:
df.iloc[ 3:8,2:5]

   Python  Excel  Power_bi
3      90     74        87
4      91     78        67
5      72     90        90
6      76     76        65
7      89     78        67

In [47]:
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [48]:
# fancy indexing
df.iloc[[2,7,9,1],[2,4]]

   Python  Power_bi
2      89        89
7      89        67
9      85        90
1      67        67

In [49]:
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [50]:
df.iloc[[2,4,8,9],[4,6]]

   Power_bi  Machine_learning
2        89                84
4        67                82
8        56                96
9        90                90

### Deleting a column ,Updating a column, Adding a new column

In [52]:
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [58]:
df['Extra'] = [1,2,3,4,5,6,7,8,9,10]
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra
0,Alpha,11,78,89,45,81,96,67,1
1,Bravo,22,67,87,67,85,95,48,2
2,Charlie,33,89,67,89,89,84,45,3
3,Delta,44,90,74,87,87,85,98,4
4,Echo,55,91,78,67,41,82,75,5
5,Foxtrot,66,72,90,90,45,81,71,6
6,Golf,77,76,76,65,96,74,70,7
7,Hotel,88,89,78,67,56,75,60,8
8,India,99,67,90,56,93,96,90,9
9,Juliet,111,85,54,90,78,90,93,10

In [60]:
df['added']=df['Id']+df['Extra']
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,added
0,Alpha,11,78,89,45,81,96,67,1,12
1,Bravo,22,67,87,67,85,95,48,2,24
2,Charlie,33,89,67,89,89,84,45,3,36
3,Delta,44,90,74,87,87,85,98,4,48
4,Echo,55,91,78,67,41,82,75,5,60
5,Foxtrot,66,72,90,90,45,81,71,6,72
6,Golf,77,76,76,65,96,74,70,7,84
7,Hotel,88,89,78,67,56,75,60,8,96
8,India,99,67,90,56,93,96,90,9,108
9,Juliet,111,85,54,90,78,90,93,10,121

In [61]:
df['Extra2'] = range(20,30)
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,added,Extra2
0,Alpha,11,78,89,45,81,96,67,1,12,20
1,Bravo,22,67,87,67,85,95,48,2,24,21
2,Charlie,33,89,67,89,89,84,45,3,36,22
3,Delta,44,90,74,87,87,85,98,4,48,23
4,Echo,55,91,78,67,41,82,75,5,60,24
5,Foxtrot,66,72,90,90,45,81,71,6,72,25
6,Golf,77,76,76,65,96,74,70,7,84,26
7,Hotel,88,89,78,67,56,75,60,8,96,27
8,India,99,67,90,56,93,96,90,9,108,28
9,Juliet,111,85,54,90,78,90,93,10,121,29

In [62]:
df['Extra3'] = np.arange(40,50)
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,added,Extra2,Extra3
0,Alpha,11,78,89,45,81,96,67,1,12,20,40
1,Bravo,22,67,87,67,85,95,48,2,24,21,41
2,Charlie,33,89,67,89,89,84,45,3,36,22,42
3,Delta,44,90,74,87,87,85,98,4,48,23,43
4,Echo,55,91,78,67,41,82,75,5,60,24,44
5,Foxtrot,66,72,90,90,45,81,71,6,72,25,45
6,Golf,77,76,76,65,96,74,70,7,84,26,46
7,Hotel,88,89,78,67,56,75,60,8,96,27,47
8,India,99,67,90,56,93,96,90,9,108,28,48
9,Juliet,111,85,54,90,78,90,93,10,121,29,49

In [63]:
df['Extra'] = [a for a in range(50) if a%5==0]
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,added,Extra2,Extra3
0,Alpha,11,78,89,45,81,96,67,0,12,20,40
1,Bravo,22,67,87,67,85,95,48,5,24,21,41
2,Charlie,33,89,67,89,89,84,45,10,36,22,42
3,Delta,44,90,74,87,87,85,98,15,48,23,43
4,Echo,55,91,78,67,41,82,75,20,60,24,44
5,Foxtrot,66,72,90,90,45,81,71,25,72,25,45
6,Golf,77,76,76,65,96,74,70,30,84,26,46
7,Hotel,88,89,78,67,56,75,60,35,96,27,47
8,India,99,67,90,56,93,96,90,40,108,28,48
9,Juliet,111,85,54,90,78,90,93,45,121,29,49

In [64]:
df['Total'] = 600
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,added,Extra2,Extra3,Total
0,Alpha,11,78,89,45,81,96,67,0,12,20,40,600
1,Bravo,22,67,87,67,85,95,48,5,24,21,41,600
2,Charlie,33,89,67,89,89,84,45,10,36,22,42,600
3,Delta,44,90,74,87,87,85,98,15,48,23,43,600
4,Echo,55,91,78,67,41,82,75,20,60,24,44,600
5,Foxtrot,66,72,90,90,45,81,71,25,72,25,45,600
6,Golf,77,76,76,65,96,74,70,30,84,26,46,600
7,Hotel,88,89,78,67,56,75,60,35,96,27,47,600
8,India,99,67,90,56,93,96,90,40,108,28,48,600
9,Juliet,111,85,54,90,78,90,93,45,121,29,49,600

In [68]:
# Deleting a column or columns 
# using del 


del df['Extra3']
del df['added']

# permanent deletes a column
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,Total
0,Alpha,11,78,89,45,81,96,67,0,600
1,Bravo,22,67,87,67,85,95,48,5,600
2,Charlie,33,89,67,89,89,84,45,10,600
3,Delta,44,90,74,87,87,85,98,15,600
4,Echo,55,91,78,67,41,82,75,20,600
5,Foxtrot,66,72,90,90,45,81,71,25,600
6,Golf,77,76,76,65,96,74,70,30,600
7,Hotel,88,89,78,67,56,75,60,35,600
8,India,99,67,90,56,93,96,90,40,600
9,Juliet,111,85,54,90,78,90,93,45,600

In [69]:
df.drop('Extra',axis=1)

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Total
0,Alpha,11,78,89,45,81,96,67,600
1,Bravo,22,67,87,67,85,95,48,600
2,Charlie,33,89,67,89,89,84,45,600
3,Delta,44,90,74,87,87,85,98,600
4,Echo,55,91,78,67,41,82,75,600
5,Foxtrot,66,72,90,90,45,81,71,600
6,Golf,77,76,76,65,96,74,70,600
7,Hotel,88,89,78,67,56,75,60,600
8,India,99,67,90,56,93,96,90,600
9,Juliet,111,85,54,90,78,90,93,600

In [71]:
df['Obtained'] = df.Python+df.Excel+df.Power_bi+df.Pandas+df.Machine_learning+df.Stats

df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,Total,Obtained
0,Alpha,11,78,89,45,81,96,67,0,600,456
1,Bravo,22,67,87,67,85,95,48,5,600,449
2,Charlie,33,89,67,89,89,84,45,10,600,463
3,Delta,44,90,74,87,87,85,98,15,600,521
4,Echo,55,91,78,67,41,82,75,20,600,434
5,Foxtrot,66,72,90,90,45,81,71,25,600,449
6,Golf,77,76,76,65,96,74,70,30,600,457
7,Hotel,88,89,78,67,56,75,60,35,600,425
8,India,99,67,90,56,93,96,90,40,600,492
9,Juliet,111,85,54,90,78,90,93,45,600,490

In [72]:
df['Percentage'] = round((df.Obtained/df.Total*100),1)
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,Total,Obtained,Percentage
0,Alpha,11,78,89,45,81,96,67,0,600,456,76.0
1,Bravo,22,67,87,67,85,95,48,5,600,449,74.8
2,Charlie,33,89,67,89,89,84,45,10,600,463,77.2
3,Delta,44,90,74,87,87,85,98,15,600,521,86.8
4,Echo,55,91,78,67,41,82,75,20,600,434,72.3
5,Foxtrot,66,72,90,90,45,81,71,25,600,449,74.8
6,Golf,77,76,76,65,96,74,70,30,600,457,76.2
7,Hotel,88,89,78,67,56,75,60,35,600,425,70.8
8,India,99,67,90,56,93,96,90,40,600,492,82.0
9,Juliet,111,85,54,90,78,90,93,45,600,490,81.7

In [73]:
df['Grade'] =['A*' if per>=90 else "A" if per>=80 else 'B' if per>=70 else 'C' if per>=60 else 'D' if per >=50 else "F" for per in df.Percentage ]
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,Total,Obtained,Percentage,Grade
0,Alpha,11,78,89,45,81,96,67,0,600,456,76.0,B
1,Bravo,22,67,87,67,85,95,48,5,600,449,74.8,B
2,Charlie,33,89,67,89,89,84,45,10,600,463,77.2,B
3,Delta,44,90,74,87,87,85,98,15,600,521,86.8,A
4,Echo,55,91,78,67,41,82,75,20,600,434,72.3,B
5,Foxtrot,66,72,90,90,45,81,71,25,600,449,74.8,B
6,Golf,77,76,76,65,96,74,70,30,600,457,76.2,B
7,Hotel,88,89,78,67,56,75,60,35,600,425,70.8,B
8,India,99,67,90,56,93,96,90,40,600,492,82.0,A
9,Juliet,111,85,54,90,78,90,93,45,600,490,81.7,A

In [74]:
# Dropping a row (row index 1)
df = df.drop(9, axis=0)

df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,Total,Obtained,Percentage,Grade
0,Alpha,11,78,89,45,81,96,67,0,600,456,76.0,B
1,Bravo,22,67,87,67,85,95,48,5,600,449,74.8,B
2,Charlie,33,89,67,89,89,84,45,10,600,463,77.2,B
3,Delta,44,90,74,87,87,85,98,15,600,521,86.8,A
4,Echo,55,91,78,67,41,82,75,20,600,434,72.3,B
5,Foxtrot,66,72,90,90,45,81,71,25,600,449,74.8,B
6,Golf,77,76,76,65,96,74,70,30,600,457,76.2,B
7,Hotel,88,89,78,67,56,75,60,35,600,425,70.8,B
8,India,99,67,90,56,93,96,90,40,600,492,82.0,A

In [75]:
# Selecting rows where Age is greater than 30
Students = df[df['Obtained'] > 450]
print("Students with Obtained marks more than 450:")
Students

Students with Obtained marks more than 450:

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,Total,Obtained,Percentage,Grade
0,Alpha,11,78,89,45,81,96,67,0,600,456,76.0,B
2,Charlie,33,89,67,89,89,84,45,10,600,463,77.2,B
3,Delta,44,90,74,87,87,85,98,15,600,521,86.8,A
6,Golf,77,76,76,65,96,74,70,30,600,457,76.2,B
8,India,99,67,90,56,93,96,90,40,600,492,82.0,A

In [76]:
Students1 = df[df['Obtained'] < 450]
Students1

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,Total,Obtained,Percentage,Grade
1,Bravo,22,67,87,67,85,95,48,5,600,449,74.8,B
4,Echo,55,91,78,67,41,82,75,20,600,434,72.3,B
5,Foxtrot,66,72,90,90,45,81,71,25,600,449,74.8,B
7,Hotel,88,89,78,67,56,75,60,35,600,425,70.8,B

# Pandas Data Loading

In [80]:

pd.read_excel("C:\Users\dilib.DESKTOP-GTP80ID\Downloads\Data-Science\Dataset")

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (1406547178.py, line 1)

In [82]:

pd.read_excel(r"C:\Users\dilib.DESKTOP-GTP80ID\Downloads\Data-Science\Dataset\SaleData.xlsx")

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
0,2018-01-06,East,Martha,Alexander,Television,95.00,1198.000,113810.00
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50.00,500.000,25000.00
2,2018-02-09,Central,Hermann,Luis,Television,36.00,1198.000,43128.00
3,2018-02-26,Central,Timothy,David,Cell Phone,27.00,225.000,6075.00
4,2018-03-15,West,Timothy,Stephen,Television,56.00,1198.000,67088.00
5,2018-04-01,East,Martha,Alexander,Home Theater,60.00,500.000,30000.00
6,2018-04-18,Central,Martha,Steven,Television,75.00,1198.000,89850.00
7,2018-05-05,Central,Hermann,Luis,Television,90.00,1198.000,107820.00
8,2018-05-22,West,Douglas,Michael,Television,32.00,1198.000,38336.00
9,2018-06-08,East,Martha,Alexander,Home Theater,60.00,500.000,30000.00
10,2018-06-25,Central,Hermann,Sigal,Television,90.00,1198.000,107820.00
11,2018-07-12,East,Martha,Diana,Home Theater,29.00,500.000,14500.00
12,2018-07-29,East,Douglas,Karen,Home Theater,81.00,500.000,40500.00
13,2018-08-15,East,Martha,Alexander,Television,35.00,1198.000,41930.00
14,2018-09-01,Central,Douglas,John,Desk,2.00,125.000,250.00
15,2018-09-18,East,Martha,Alexander,Video Games,16.00,58.500,936.00
16,2018-10-05,Central,Hermann,Sigal,Home Theater,28.00,500.000,14000.00
17,2018-10-22,East,Martha,Alexander,Cell Phone,64.00,225.000,14400.00
18,2018-11-08,East,Douglas,Karen,Cell Phone,15.00,225.000,3375.00
19,2018-11-25,Central,Hermann,Shelli,Video Games,96.00,58.500,5616.00
20,2018-12-12,Central,Douglas,John,Television,67.00,1198.000,80266.00
21,2018-12-29,East,Douglas,Karen,Video Games,74.00,58.500,4329.00
22,2019-01-15,Central,Timothy,David,Home Theater,46.00,500.000,23000.00
23,2019-02-01,Central,Douglas,John,Home Theater,87.00,500.000,43500.00
24,2019-02-18,East,Martha,Alexander,Home Theater,4.00,500.000,2000.00
25,2019-03-07,West,Timothy,Stephen,Home Theater,7.00,500.000,3500.00
26,2019-03-24,Central,Hermann,Luis,Video Games,50.00,58.500,2925.00
27,2019-04-10,Central,Martha,Steven,Television,66.00,1198.000,79068.00
28,2019-04-27,East,Martha,Diana,Cell Phone,96.00,225.000,21600.00
29,2019-05-14,Central,Timothy,David,Television,53.00,1198.000,63494.00
30,2019-05-31,Central,Timothy,David,Home Theater,80.00,500.000,40000.00
31,2019-06-17,Central,Hermann,Shelli,Desk,5.00,125.000,625.00
32,2019-07-04,East,Martha,Alexander,Video Games,62.00,58.500,3627.00
33,2019-07-21,Central,Hermann,Sigal,Video Games,55.00,58.500,3217.50
34,2019-08-07,Central,Hermann,Shelli,Video Games,42.00,58.500,2457.00
35,2019-08-24,West,Timothy,Stephen,Desk,3.00,125.000,375.00
36,2019-09-10,Central,Timothy,David,Television,7.00,1198.000,8386.00
37,2019-09-27,West,Timothy,Stephen,Cell Phone,76.00,225.000,17100.00
38,2019-10-14,West,Douglas,Michael,Home Theater,57.00,500.000,28500.00
39,2019-10-31,Central,Martha,Steven,Television,14.00,1198.000,16772.00
40,2019-11-17,Central,Hermann,Luis,Home Theater,11.00,500.000,5500.00
41,2019-12-04,Central,Hermann,Luis,Home Theater,94.00,500.000,47000.00
42,2019-12-21,Central,Martha,Steven,Home Theater,28.00,500.000,14000.00
43,NaT,NaN,NaN,NaN,NaN,278.00,1125.000,62550.00
44,NaT,NaN,NaN,NaN,NaN,34.75,140.625,7818.75